In [76]:
# import modules and libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [99]:
# import dataset
data = pd.read_csv('car_data.csv')
data.head(10)

                name    price  year        mileage  engine transmission
0          Mazda MX5   £7,499  2007   63,131 miles  Petrol       Manual
1          Jaguar XF   £7,775  2010   61,890 miles  Petrol    Automatic
2            Audi A6   £6,950  2012  129,170 miles  Diesel    Automatic
3     Nissan Qashqai   £7,790  2013   44,900 miles  Petrol    Automatic
4          MINI Mini  £15,999  2017   32,012 miles  Petrol       Manual
5   Mercedes B Class  £10,995  2015   33,050 miles  Diesel    Automatic
6  Volkswagen Touran   £7,250  2011   62,000 miles  Diesel       Manual
7      Vauxhall ADAM   £5,990  2014   44,000 miles  Petrol       Manual
8       Toyota Prius   £6,290  2013  172,000 miles  Hybrid    Automatic
9     Skoda Roomster   £4,450  2012   74,000 miles  Diesel       Manual

In [100]:
#get the shape of the data
data.shape

(3000, 6)

In [101]:
#get the statistical description of the float columns
data.describe()

             name   price  year       mileage  engine transmission
count        3000    3000  3000          3000    3000         2990
unique        548    1136    26          2484      11           10
top     Ford Kuga  £4,995  2018  60,000 miles  Petrol       Manual
freq          139      35   574            13    1594         1900

In [102]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   name          3000 non-null   object
 1   price         3000 non-null   object
 2   year          3000 non-null   object
 3   mileage       3000 non-null   object
 4   engine        3000 non-null   object
 5   transmission  2990 non-null   object
dtypes: object(6)
memory usage: 140.8+ KB

In [103]:
data.isnull().sum()

name             0
price            0
year             0
mileage          0
engine           0
transmission    10
dtype: int64

There are 10 missing values in the transmission column. That is a very small number so we need to check the column to see how we can clean it

In [104]:
data[data['transmission'].isnull()]

,name,price,year,mileage,engine,transmission
43,Toyota Yaris,"£3,395","28,600 miles",Petrol,Manual,NaN
44,Toyota AYGO,"£4,995","50,382 miles",Petrol,Manual,NaN
858,Lexus CT,"£14,999",2017,"33,845 miles",Automatic,NaN
1096,Renault Clio,"£9,499","18,000 miles",Diesel,Manual,NaN
1119,Jaguar XF,"£12,699","64,000 miles",Diesel,Manual,NaN
1137,BMW 1 Series,"£7,999",2013,Diesel,Manual,NaN
1639,NISSAN LEAF,"£6,500",2013,"51,000 miles",Automatic,NaN
1795,BMW 3 SERIES,"£18,450",2018,"34,000 miles",Automatic,NaN
1859,Mercedes SL,"£29,938",2014,Petrol,Automatic,NaN
1972,Toyota Prius,"£6,995","180,000 miles",Hybrid,Automatic,NaN

The rows with null values are small and look inconsistent, so it is best we delete it

In [105]:
data= data.dropna()
data.shape

(2990, 6)

Ten rows have been deleted which is less than 1% of the total data

In [106]:
#delete duplicate rows 
data = data.drop_duplicates(keep= 'first', inplace=False)

In [107]:
data.shape

(2986, 6)

## NAME

We will extract the name of the car manufacturers from the name column

In [108]:
data['manufacturer'] = data['name'].apply(lambda x: x.split(' ')[0])
data['manufacturer'].head()

0     Mazda
1    Jaguar
2      Audi
3    Nissan
4      MINI
Name: manufacturer, dtype: object

In [109]:
data.manufacturer.nunique()

74

In [110]:
data.manufacturer.unique()

array(['Mazda', 'Jaguar', 'Audi', 'Nissan', 'MINI', 'Mercedes',
       'Volkswagen', 'Vauxhall', 'Toyota', 'Skoda', 'Ford', 'Chevrolet',
       'BMW', 'Suzuki', 'Renault', 'Peugeot', 'Citroen', 'Volvo', 'Fiat',
       'DS', 'Dacia', 'Abarth', 'Smart', 'SEAT', 'Mitsubishi', 'MG',
       'Mercedes-Benz', 'Lexus', 'Land', 'Kia', 'Jeep', 'Hyundai',
       'Honda', 'Maserati', 'Bmw', 'Seat', 'Mini', 'HYUNDAI', 'FORD',
       'VAUXHALL', 'AUDI', 'VOLKSWAGEN', 'PEUGEOT', 'MITSUBISHI', 'VOLVO',
       'MERCEDES-BENZ', 'SUZUKI', 'smart', 'Ds', 'Subaru',
       'Mercedes-benz', 'RENAULT', 'SMART', 'PORSCHE', 'FIAT', 'HONDA',
       'Infiniti', 'SKODA', 'Porsche', 'Bentley', 'Alfa', 'DACIA',
       'ABARTH', 'INFINITI', 'TOYOTA', 'NISSAN', 'MAZDA', 'MASERATI',
       'LAND', 'KIA', 'JAGUAR', 'CITROEN', 'Chrysler', 'Isuzu'],
      dtype=object)

We will clean these data by making similar maufacturers uniform.

In [111]:
data = data.replace({'manufacturer' : 
            {'MAZDA' : 'Mazda', 'JAGUAR':'Jaguar', 'AUDI' : 'Audi', 'NISSAN': 'Nissan', 'MINI': 'Mini', 
             'VOLKSWAGEN':'Volkswagen', 'VAUXHALL':'Vauxhall', 'TOYOTA':'Toyota', 'SKODA':'Skoda', 'FORD':'Ford',
             'Bmw':'BMW','SUZUKI' : 'Suzuki', 'RENAULT':'Renault', 'PEUGEOT':'Peugeot', 'CITROEN':'Citroen',
             'VOLVO':'Volvo', 'FIAT':'Fiat', 'Ds':'DS', 'DACIA':'Dacia', 'ABARTH':'Abarth', 'SMART':'Smart', 
             'smart':'Smart','SEAT':'Seat', 'MITSUBISHI':'Mitsubishi', 'KIA':'Kia', 'HYUNDAI':'Hyundai',
             'HONDA':'Honda','MASERATI':'Maserati', 'PORSCHE':'Porsche', 'INFINITI':'Infiniti', 'Alfa':'Alfa-Romero',
             'Mercedes': 'Mercedes-Benz', 'MERCEDES-BENZ': 'Mercedes-Benz', 'Mercedes-benz': 'Mercedes-Benz',
             'Land':'Land-Rover', 'LAND': 'Land-Rover'}
             })

print(data.manufacturer.unique())
print('\n')
print('There are ' + str(data.manufacturer.nunique()) + ' different car manufacturers in the dataset')

['Mazda' 'Jaguar' 'Audi' 'Nissan' 'Mini' 'Mercedes-Benz' 'Volkswagen'
 'Vauxhall' 'Toyota' 'Skoda' 'Ford' 'Chevrolet' 'BMW' 'Suzuki' 'Renault'
 'Peugeot' 'Citroen' 'Volvo' 'Fiat' 'DS' 'Dacia' 'Abarth' 'Smart' 'Seat'
 'Mitsubishi' 'MG' 'Lexus' 'Land-Rover' 'Kia' 'Jeep' 'Hyundai' 'Honda'
 'Maserati' 'Subaru' 'Porsche' 'Infiniti' 'Bentley' 'Alfa-Romero'
 'Chrysler' 'Isuzu']


There are 40 different car manufacturers in the dataset

## PRICE

In [112]:
data['price'] = data['price'].str.replace(',', '').str.replace('£', '').astype(np.int64)
data['price'].head()

0     7499
1     7775
2     6950
3     7790
4    15999
Name: price, dtype: int64

## YEAR

We can't work with the year column like that, we have to convert it to age so that it will be easy to understand

In [113]:
#convert the year column to integer
data['year']=data['year'].astype(str).astype(np.int64)

In [114]:
Current_Year = 2021

In [115]:
data['age'] = Current_Year - data['year']

In [116]:
data['age'] = data['age'].astype(np.int64)

In [117]:
data['age'].head()

0    14
1    11
2     9
3     8
4     4
Name: age, dtype: int64

## MILEAGE

Remove the commas and miles from the mileage column

In [118]:
data['mileage'] = data['mileage'].str.replace(',', '').str.replace(' ', '').str.replace('miles', '').astype(np.int64)
data['mileage'].head()

0     63131
1     61890
2    129170
3     44900
4     32012
Name: mileage, dtype: int64

## ENGINE

In [119]:
data['engine'].unique()

array(['Petrol', 'Diesel', 'Hybrid', 'Electric', 'Plug_in_hybrid',
       'Petrol hybrid', 'Petrol/electric', 'Petrol / electric hy',
       'Petrol plug-in hybri'], dtype=object)

In [124]:
data = data.replace({'engine' : 
                     {'Petrol hybrid': 'Hybrid', 'Petrol hybrid': 'Hybrid', 
                      'Petrol / electric hy' : 'Hybrid', 'Petrol plug-in hybri': 'Plug_in_hybrid',
                     'Petrol/electric' : 'Hybrid'}
                     })
data['engine'].unique()

array(['Petrol', 'Diesel', 'Hybrid', 'Electric', 'Plug_in_hybrid'],
      dtype=object)

## TRANSMISSION

In [126]:
data['transmission'].unique()

array(['Manual', 'Automatic', 'Semi auto', 'Semiauto', 'G-tronic+',
       'Semiautomatic', 'Cvt', 'Semi automatic', 'Manual ',
       'Semi-automatic'], dtype=object)

In [132]:
data = data.replace({'transmission' : 
                     {'Semi auto': 'Semiautomatic', 'Semiauto': 'Semiautomatic',
                      'Semi automatic': 'Semiautomatic', 'Manual ': 'Manual',
                      'Semi-automatic': 'Semiautomatic', 'G-tronic+': 'Automatic',
                      'Cvt': 'Automatic'}
                     
                     })

Reorder the columns to make the dataframe easy to understand

In [130]:
data = data[['name', 'manufacturer', 'year', 'age', 'mileage', 'engine', 'transmission', 'price']]
data.head()

             name manufacturer  year  age  mileage  engine transmission  price
0       Mazda MX5        Mazda  2007   14    63131  Petrol       Manual   7499
1       Jaguar XF       Jaguar  2010   11    61890  Petrol    Automatic   7775
2         Audi A6         Audi  2012    9   129170  Diesel    Automatic   6950
3  Nissan Qashqai       Nissan  2013    8    44900  Petrol    Automatic   7790
4       MINI Mini         Mini  2017    4    32012  Petrol       Manual  15999

In [134]:
data.shape

(2986, 8)

In [135]:
#save the cleaned data to a csv file

data.to_csv('cleaned_car_data.csv', index = False)